druzyek/RPN_Calculator/MSP430/rpnslave.c
/**   RPN Scientific Calculator for MSP430
 *    Copyright (C) 2013 Joey Shepard
 *
 *    This program is free software: you can redistribute it and/or modify
 *    it under the terms of the GNU General Public License as published by
 *    the Free Software Foundation, either version 3 of the License, or
 *    (at your option) any later version.
 *
 *    This program is distributed in the hope that it will be useful,
 *    but WITHOUT ANY WARRANTY; without even the implied warranty of
 *    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *    GNU General Public License for more details.
 *
 *    You should have received a copy of the GNU General Public License
 *    along with this program.  If not, see <http://www.gnu.org/licenses/>.
**/

#include <msp430.h>
#include <stdbool.h>
#include "common.h"

#define ADDRESS_LATCH   BIT0  //P1.0 SRAM 595 latches
#define UART_RXD        BIT1  //P1.1 To TXD of slave
#define UART_TXD        BIT2  //P1.2 To RXD of slave
#define RAM_OE          BIT3  //P1.3 SRAM #OE
#define RAM_WE          BIT4  //P1.4 SRAM #WE
#define ADRESSS_CLOCK   BIT5  //P1.5 SRAM 595 clock
#define LED             BIT6  //P1.6 LED
#define ADDRESS_DATA    BIT7  //P1.7 SRAM 595 data

#pragma MM_READ RAM_Read
#pragma MM_WRITE RAM_Write
#pragma MM_ON

static void Init();

static void RAM_Write(const unsigned char *a1, const unsigned char byte);
static unsigned char RAM_Read(const unsigned char *a1);

static void MakeTables();

static void AddBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2);
static void SubBCD(unsigned char *result, const unsigned char *n1, unsigned char *n2);
static void ImmedBCD(const char *text, unsigned char *BCD);
static void BufferBCD(const unsigned char *text, unsigned char *BCD);
static void PrintBCD(const unsigned char *BCD, int dec_point);
static void MultBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2);
static void DivBCD(unsigned char *result, const unsigned char *n1, const unsigned char *n2);
static void ShrinkBCD(unsigned char *dest,unsigned char *src);
static void FullShrinkBCD(unsigned char *n1);
static void PadBCD(unsigned char *n1, int amount);
static bool IsZero(unsigned char *n1);
static void CopyBCD(unsigned char *dest, unsigned char *src);
static bool LnBCD(unsigned char *result, unsigned char *arg);
static void ExpBCD(unsigned char *result, unsigned char *arg);
static void RolBCD(unsigned char *result, unsigned char *arg, unsigned char amount);
static void RorBCD(unsigned char *result, unsigned char *arg, unsigned char amount);
static void PowBCD(unsigned char *result, unsigned char *base, unsigned char *exp);
static void TanBCD(unsigned char *sine_result,unsigned char *cos_result,unsigned char *arg);
static void AcosBCD(unsigned char *result,unsigned char *arg);
static void AsinBCD(unsigned char *result,unsigned char *arg);
static void AtanBCD(unsigned char *result,unsigned char *arg);
static void CalcTanBCD(unsigned char *result1,unsigned char *result2,unsigned char *result3,unsigned char *arg,unsigned char flag);
static unsigned char CompBCD(const char *num, unsigned char *var);
static unsigned char CompVarBCD(unsigned char *var1, unsigned char *var2);
static unsigned char TrigPrep(unsigned int stack_ptr_copy,unsigned char *cosine);

static void SetDecPlaces();

#pragma MM_OFFSET 2000
#pragma MM_GLOBALS
  unsigned char p0[260]; //PowBCD, LnBCD, ExpBCD, TanBCD, AtanBCD, typing,    CompBCD
  unsigned char p1[260]; //PowBCD, LnBCD, ExpBCD, TanBCD, AtanBCD, DrawStack, CompBCD, CompVarBCD
  unsigned char p2[260]; //PowBCD, LnBCD, ExpBCD, TanBCD, AtanBCD
  unsigned char p3[260]; //PowBCD
  unsigned char p4[260]; //PowBCD
  unsigned char p5[260];
  unsigned char p6[260];
  unsigned char p7[260];
  unsigned char buffer[260]; //AddBCD
  unsigned char perm_buff1[260]; //DivBCD, MultBCD
  unsigned char perm_buff2[260]; //DivBCD
  unsigned char perm_buff3[260]; //DivBCD
  //unsigned char logs[MATH_LOG_TABLE*MATH_ENTRY_SIZE];
  unsigned char logs[4218];
  //unsigned char trig[MATH_TRIG_TABLE*MATH_ENTRY_SIZE];
  unsigned char trig[4218];
  unsigned char perm_zero[4];
  unsigned char perm_K[36];
  unsigned char perm_log10[36];
  unsigned char BCD_stack[2600];
  unsigned char stack_buffer[260];
#pragma MM_END

struct SettingsType Settings;

int main(void)
{
  WDTCTL=WDTPW + WDTHOLD;

  BCSCTL1=CALBC1_16MHZ;
  DCOCTL=CALDCO_16MHZ;

  volatile unsigned int i;
  for (i=0;i<32000;i++); //Let clock settle. Necessary?

  UCA0CTL1=UCSWRST|UCSSEL_2;
  UCA0CTL0 = 0;
  UCA0MCTL = UCBRS_5;
  UCA0BR0 = 131;
  UCA0BR1 = 0;
  UCA0CTL1&=~UCSWRST;
  //UC0IE |= UCA0RXIE | UCA0TXIE;
  __enable_interrupt();

  UCB0CTL1=UCSWRST;
  UCB0CTL0=UCCKPL|UCMST|UCSYNC;//|UCMSB;
  UCB0CTL1|=UCSSEL_2;
  UCB0BR0=0;
  UCB0BR1=0;
  UCB0CTL1&=~UCSWRST;

  P1SEL=ADRESSS_CLOCK|ADDRESS_DATA|UART_RXD|UART_TXD;
  P1SEL2=ADRESSS_CLOCK|ADDRESS_DATA|UART_RXD|UART_TXD;

  P2SEL=0;
  P2SEL2=0;

  //This is important!
  P1OUT=RAM_OE|RAM_WE;
  //P1OUT&=~SLAVE_CLOCK;
  P1DIR=RAM_OE|RAM_WE|ADDRESS_LATCH|LED|UART_TXD;//UART_TXD necessary?

  P2DIR=0;

  //unsigned int a0=0;
  //unsigned char data=0,counter=0;

  //delay_ms(5000);

  /*for (;;)
  {
    P1OUT^=LED;
    UART_Send(data++);
    UART_Send(data++);
    UART_Send(data++);
    delay_ms(1000);
  }*/

  /*#define A_MAX 65535
  for (;;)
  {
    P1OUT^=LED;
    for (a0=0;a0<A_MAX;a0++)
    {
      RAM_Write((unsigned char *)a0,2*(a0%97));
      //__delay_cycles(5000);
    }
    for (a0=0;a0<A_MAX;a0++)
    {
      data=RAM_Read((unsigned char *)a0);
      //__delay_cycles(5000);
      if (data!=(2*(a0%97)))
      {
        UART_Send(0);
        UART_Send(a0>>8);
        UART_Send(a0&0xFF);
        UART_Send(data);
        UART_Send(2*(a0%97));
        UART_Send(RAM_Read((unsigned char *)a0));
        UART_Send(counter);
        for (;;)
        {
          P1OUT&=~LED;
          delay_ms(600);
          P1OUT|=LED;
          delay_ms(200);
          P1OUT&=~LED;
          delay_ms(200);
          P1OUT|=LED;
          delay_ms(200);
        }
      }
    }
    counter++;
  }*/

  #pragma MM_ASSIGN_GLOBALS

