druzyek/RPN_Calculator/MSP430/rpnslave.c
  /*for (;;)
  {
    UART_SendWord(UART_ReceiveWord(false),true);
  }*/

  unsigned int a0,a1,a2,a3;
  unsigned char b0,b1;
  unsigned char command;

  Init();

  for (;;)
  {
    //This could be collapsed with function pointers
    command=UART_Receive(false);
    P1OUT|=LED;
    switch (command)
    {
      case SlaveRAM_Read:
        a0=UART_ReceiveWord(false);
        UART_Send(RAM_Read((unsigned char *)a0),true);
        break;
      case SlaveRAM_Write:
        a0=UART_ReceiveWord(false);
        RAM_Write((unsigned char *)a0,UART_Receive(true));
        UART_Ready();
        break;
      case SlaveSync:
        UART_Send(SlaveAnswer,true);
        break;
      case SlaveMakeTables:
        MakeTables();
        UART_Ready();
        break;
      case SlaveAdd:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        AddBCD((unsigned char *)a0,(unsigned char *)a1,(unsigned char *)a2);
        UART_Ready();
        break;
      case SlaveSubtract:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        SubBCD((unsigned char *)a0,(unsigned char *)a1,(unsigned char *)a2);
        UART_Ready();
        break;
      case SlaveBuffer:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        BufferBCD((unsigned char *)a0,(unsigned char *)a1);
        UART_Ready();
        break;
      case SlaveMultiply:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        MultBCD((unsigned char *)a0,(unsigned char *)a1,(unsigned char *)a2);
        UART_Ready();
        break;
      case SlaveDivide:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        DivBCD((unsigned char *)a0,(unsigned char *)a1,(unsigned char *)a2);
        UART_Ready();
        break;
      case SlaveShrink:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        ShrinkBCD((unsigned char *)a0,(unsigned char *)a1);
        UART_Ready();
        break;
      case SlaveFullShrink:
        a0=UART_ReceiveWord(true);
        FullShrinkBCD((unsigned char *)a0);
        UART_Ready();
        break;
      case SlavePad:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        PadBCD((unsigned char *)a0,(int)a1);
        UART_Ready();
        break;
      case SlaveIsZero:
        a0=UART_ReceiveWord(false);
        if (IsZero((unsigned char *)a0)) UART_Send(1,true);
        else UART_Send(0,true);
        break;
      case SlaveCopy:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        CopyBCD((unsigned char *)a0,(unsigned char *)a1);
        UART_Ready();
        break;
      case SlaveLn:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        if (LnBCD((unsigned char *)a0,(unsigned char *)a1)) UART_Send(1,true);
        else UART_Send(0,true);
        break;
      case SlaveExp:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        ExpBCD((unsigned char *)a0,(unsigned char *)a1);
        UART_Ready();
        break;
      case SlaveRol:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        RolBCD((unsigned char *)a0,(unsigned char *)a1,a2);
        UART_Ready();
        break;
      case SlaveRor:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        RorBCD((unsigned char *)a0,(unsigned char *)a1,a2);
        UART_Ready();
        break;
      case SlavePow:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        PowBCD((unsigned char *)a0,(unsigned char *)a1,(unsigned char *)a2);
        UART_Ready();
        break;
      case SlaveTan:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(true);
        TanBCD((unsigned char *)a0,(unsigned char *)a1,(unsigned char *)a2);
        UART_Ready();
        break;
      case SlaveAcos:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        AcosBCD((unsigned char *)a0,(unsigned char *)a1);
        UART_Ready();
        break;
      case SlaveAsin:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        AsinBCD((unsigned char *)a0,(unsigned char *)a1);
        UART_Ready();
        break;
      case SlaveAtan:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(true);
        AtanBCD((unsigned char *)a0,(unsigned char *)a1);
        UART_Ready();
        break;
      case SlaveCalcTan:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        a2=UART_ReceiveWord(false);
        a3=UART_ReceiveWord(false);
        b0=UART_Receive(true);
        CalcTanBCD((unsigned char *)a0,(unsigned char *)a1,(unsigned char *)a2,(unsigned char *)a3,b0);
        UART_Ready();
        break;
      case SlaveCompVar:
        a0=UART_ReceiveWord(false);
        a1=UART_ReceiveWord(false);
        UART_Send(CompVarBCD((unsigned char *)a0,(unsigned char *)a1),true);
        break;
      case SlaveTrigPrep:
        a0=UART_ReceiveWord(false);
        b1=TrigPrep(a0,&b0);
        UART_Send(b0,true);
        UART_Send(b1,true);
        break;
      case SlaveSettings:
        Settings.DecPlaces=UART_Receive(false);
        Settings.DegRad=UART_Receive(false);
        Settings.LogTableSize=UART_Receive(false);
        Settings.TrigTableSize=UART_Receive(false);
        break;
      case SlaveSetDecPlaces:
        SetDecPlaces();
        UART_Ready();
        break;
    }
    P1OUT&=~LED;
  }
}

/*
#pragma vector=USCIAB0RX_VECTOR
__interrupt void USCI0RX_ISR(void)
{
  UC0IFG &= ~UCA0RXIFG;
  RXD_Buff = UCA0RXBUF;
}

#pragma vector=USCIAB0TX_VECTOR
__interrupt void USCI0TX_ISR(void)
{
  UC0IFG &= ~UCA0TXIFG;
}
*/

static void Init()
{
  Settings.DecPlaces=12;
  Settings.DegRad=true;
  Settings.LogTableSize=MATH_LOG_TABLE;
  Settings.TrigTableSize=MATH_TRIG_TABLE;

