druzyek/RPN_Calculator/MSP430/rpnslave.c
  while (amount)
  {
    if (amount>3)
    {
      for (i=0;i<6;i++) accum[i]=0;
      amount-=4;

      t1=result[BCD_DEC];
      b0=0;
      i_end=result[BCD_LEN]+3;
      for (i=3;i<i_end;i++)
      {
        b1=0;
        b2=result[i]*4;
        for (j=3;j>=-1;j--)
        {
          if (j>=0) accum[b0+j]+=table[b2+j]+b1;
          else accum[b0+j]+=b1;

          if (accum[b0+j]>9)
          {
            accum[b0+j]-=10;
            b1=1;
          }
          else b1=0;
        }

        if (b0!=2) b0++;
        else
        {
          if (t1) result[i-2]=accum[0];
          else result[i-1]=accum[0];

          for (j=0;j<5;j++) accum[j]=accum[j+1];
          accum[5]=0;
        }
      }

      b1=result[BCD_LEN]+3;
      if (t1)
      {
        t1--;
        result[BCD_LEN]=b1;
        result[BCD_DEC]=t1;
        b2=i-b0;
      }
      else
      {
        b1++;
        result[3]=0;
        result[BCD_LEN]=b1;
        b2=i-b0+1;
      }
      for (j=0;j<5;j++) result[j+b2]=accum[j];

      if ((b1-t1)>Settings.DecPlaces) result[BCD_LEN]=t1+Settings.DecPlaces;
    }
    else
    {
      amount--;
      i_end=result[BCD_LEN]+3;
      b1=0;
      for (i=3;i<i_end;i++)
      {
        b0=result[i];
        b2=b0;
        b0=(b0>>1)+b1;
        b1=0;
        if (b2&1) b1=8;
        if (b0>7) b0-=3;
        result[i]=b0;
      }
      if (b1)
      {
        if((result[BCD_LEN]-result[BCD_DEC])<Settings.DecPlaces)
        {
          b1=result[BCD_LEN]+1;
          result[BCD_LEN]=b1;
          result[b1+2]=5;
        }
      }
    }
  }
}

static void PowBCD(unsigned char *result, unsigned char *base, unsigned char *exp)
{
  LnBCD(p3,base);
  MultBCD(p4,p3,exp);
  ExpBCD(result,p4);
}

static void TanBCD(unsigned char *sine_result,unsigned char *cos_result,unsigned char *arg)
{
  #pragma MM_VAR sine_result
  #pragma MM_VAR cos_result

  CopyBCD(p2,perm_zero);
  CopyBCD(sine_result,perm_zero);
  CopyBCD(cos_result,perm_K);

  CalcTanBCD(sine_result,cos_result,p2,arg,0);
  sine_result[BCD_LEN]=Settings.DecPlaces;
  cos_result[BCD_LEN]=Settings.DecPlaces;
}

static void AcosBCD(unsigned char *result,unsigned char *arg)
{
  CopyBCD(p0,arg);
  MultBCD(p1,p0,arg);
  ImmedBCD("1",p0);
  SubBCD(p5,p0,p1);
  ImmedBCD("0.5",p6);
  PowBCD(p7,p5,p6);
  DivBCD(p6,p7,arg);
  AtanBCD(result,p6);
}

static void AsinBCD(unsigned char *result,unsigned char *arg)
{
  CopyBCD(p0,arg);
  MultBCD(p1,p0,arg);
  ImmedBCD("1",p0);
  SubBCD(p5,p0,p1);
  ImmedBCD("0.5",p6);
  PowBCD(p7,p5,p6);
  DivBCD(p6,arg,p7);
  AtanBCD(result,p6);
}

static void AtanBCD(unsigned char *result,unsigned char *arg)
{
  #pragma MM_VAR result

  CopyBCD(result,perm_zero);
  ImmedBCD("1",p2);
  CopyBCD(p3,arg);
  CalcTanBCD(p2,p3,result,arg,1);



  if ((result[BCD_DEC]<=Settings.DecPlaces)&&(result[BCD_LEN]>Settings.DecPlaces)) result[BCD_LEN]=Settings.DecPlaces;
}

static void CalcTanBCD(unsigned char *result1,unsigned char *result2,unsigned char *result3,unsigned char *arg,unsigned char flag)
{
  #pragma MM_VAR result2

  unsigned int i;
  unsigned int trig_ptr=0;

  //function pointers could reduce flash size
  for (i=0;i<Settings.TrigTableSize;i++)
  {
    if (flag==0) SubBCD(p1,arg,result3);

    if (((flag==0)&&(p1[BCD_SIGN]==0))||((flag==1)&&(result2[BCD_SIGN]==0)))
    {
      RorBCD(p0,result2,i);
      AddBCD(p1,result1,p0);
      RorBCD(p0,result1,i);
      CopyBCD(result1,p1);
      SubBCD(p1,result2,p0);
      CopyBCD(result2,p1);
      AddBCD(p0,result3,trig+trig_ptr);
    }
    else
    {
      RorBCD(p0,result2,i);
      SubBCD(p1,result1,p0);
      RorBCD(p0,result1,i);
      CopyBCD(result1,p1);
      AddBCD(p1,result2,p0);
      CopyBCD(result2,p1);
      SubBCD(p0,result3,trig+trig_ptr);
    }
    CopyBCD(result3,p0);
    trig_ptr+=MATH_ENTRY_SIZE;
  }
}

static unsigned char CompBCD(const char *num, unsigned char *var)
{
  ImmedBCD(num,p0);
  return CompVarBCD(p0,var);
}

static unsigned char CompVarBCD(unsigned char *var1, unsigned char *var2)
{
  SubBCD(p1,var1,var2);
  if (IsZero(p1)) return COMP_EQ;
  else if (p1[BCD_SIGN]==0) return COMP_GT;
  else return COMP_LT;
}

//convert angle to 0-90 format and put in p3
static unsigned char TrigPrep(unsigned int stack_ptr_copy,unsigned char *cosine)
{
  int sine;

  if (Settings.DegRad) CopyBCD(p3,BCD_stack+(stack_ptr_copy-1)*MATH_CELL_SIZE);
  else
  {
    ImmedBCD(deg_factor,p0);
    MultBCD(p3,BCD_stack+(stack_ptr_copy-1)*MATH_CELL_SIZE,p0);
  }

  ImmedBCD("360",p2);
  while(CompVarBCD(p3,p2)==COMP_GT) CopyBCD(p3,p1);

  if (CompBCD("180",p3)==COMP_LT)
  {
    SubBCD(stack_buffer,p2,p3);
    sine=1;
  }
  else
  {
    CopyBCD(stack_buffer,p3);
    sine=0;
  }
  if (CompBCD("90",stack_buffer)==COMP_LT)
  {
    ImmedBCD("180",p2);
    SubBCD(p3,p2,stack_buffer);
    *cosine=1;
  }
  else
  {
    CopyBCD(p3,stack_buffer);
    *cosine=0;
  }
  return sine;
}

static void SetDecPlaces()
{
  int i,j=2;

  for (i=0;i<MATH_TRIG_TABLE;i++)
  {
    trig[i*MATH_ENTRY_SIZE+BCD_LEN]=j+Settings.DecPlaces;
    if (IsZero(trig+i*MATH_ENTRY_SIZE)) break;
  }

  Settings.TrigTableSize=i;

  for (i=0;i<MATH_LOG_TABLE;i++)
  {
    logs[i*MATH_ENTRY_SIZE+BCD_LEN]=j+Settings.DecPlaces;
    if (IsZero(logs+i*MATH_ENTRY_SIZE)) break;
  }

  Settings.LogTableSize=i;

  perm_K[BCD_LEN]=1+Settings.DecPlaces;
  perm_log10[BCD_LEN]=1+Settings.DecPlaces;
}
